RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pka_regs.h
/*
 * CRYPTO_OP (RW)
 *
 * When CTRL[PRIM_OP]=1,
 * 0: Modulus MULT
 * 0x1: Modulus ADD
 * 0x2: Modulus MINUS
 * 0x3: GCD
 * 0x4: memory copy (address range should not overlap, no check of this)
 * 0x5: asr1
 * 0x6: sr1
 * 0x7: bn_len
 * 0x8: DeProj
 * 0x9: disable memory copy
 * 0xA. Find BN modulus
 * 0xC. KEY2SDP (copy key from internal to sdp interface)
 * 0xD. ECCPointAdd
 * 0xE. SCL_MOD (cal h*k mod n, GFp domain)
 * When CTRL[PRIM_OP]=0,
 * 0x0: ini the PKA parameters.  This is to store the config parameters that are assigned in interface regs, and do norm2mont transfers to the related ECC A/B/GX/GY.
 * 0x2: For ECC, do scalar multiplication. For RSA, do power modulus. So this mode can be used to generate the public key.
 *     For RSA, Before entering key generation, whole mem rd is  blocked. --> During key generation. Np is p, pub_key is q, --> prod is p*q, encrpt_msg is phi, Np and pub_key is cleared --> then priv_key is priv_key, --> then pub_key is cal --> encrpt_msg is cleaed --> mem blockage removed.
 *     For ECC, Before entering key generation, whole mem rd is  blocked. --> check A/B/P are valid values --> randomly choose GX --> search for GY --> cal order N, stored in NP --> if N is great enough, randomly choose private K -->  cal PX, PY --> NP is cleaed --> mem blockage removed.
 * 0x5: SM2 DSA gen (must use internal stored ECC parameters)
 * 0xC: SM2 DSA verify (must use internal stored ECC parameters, with PAX, PAY not in mont type yet)
 * 0x1C: SM2 DSA verify (with PAX, PAY already in mont type)
 */
#define PKA_CTRL_CRYPTO_OP_MASK (0xF8U)
#define PKA_CTRL_CRYPTO_OP_SHIFT (3U)
#define PKA_CTRL_CRYPTO_OP_SET(x) (((uint32_t)(x) << PKA_CTRL_CRYPTO_OP_SHIFT) & PKA_CTRL_CRYPTO_OP_MASK)
#define PKA_CTRL_CRYPTO_OP_GET(x) (((uint32_t)(x) & PKA_CTRL_CRYPTO_OP_MASK) >> PKA_CTRL_CRYPTO_OP_SHIFT)

/*
 * OP_ACTIVE (RW)
 *
 * 1: operation active. Self clear
 * 0: operation not active
 */
#define PKA_CTRL_OP_ACTIVE_MASK (0x4U)
#define PKA_CTRL_OP_ACTIVE_SHIFT (2U)
#define PKA_CTRL_OP_ACTIVE_SET(x) (((uint32_t)(x) << PKA_CTRL_OP_ACTIVE_SHIFT) & PKA_CTRL_OP_ACTIVE_MASK)
#define PKA_CTRL_OP_ACTIVE_GET(x) (((uint32_t)(x) & PKA_CTRL_OP_ACTIVE_MASK) >> PKA_CTRL_OP_ACTIVE_SHIFT)

/*
 * ECC1_RSA0 (RW)
 *
 * crypto_op
 */
#define PKA_CTRL_ECC1_RSA0_MASK (0x2U)
#define PKA_CTRL_ECC1_RSA0_SHIFT (1U)
#define PKA_CTRL_ECC1_RSA0_SET(x) (((uint32_t)(x) << PKA_CTRL_ECC1_RSA0_SHIFT) & PKA_CTRL_ECC1_RSA0_MASK)
#define PKA_CTRL_ECC1_RSA0_GET(x) (((uint32_t)(x) & PKA_CTRL_ECC1_RSA0_MASK) >> PKA_CTRL_ECC1_RSA0_SHIFT)

/*
 * PKA_EN (RW)
 *
 * 1b-Enabled
 */
#define PKA_CTRL_PKA_EN_MASK (0x1U)
#define PKA_CTRL_PKA_EN_SHIFT (0U)
#define PKA_CTRL_PKA_EN_SET(x) (((uint32_t)(x) << PKA_CTRL_PKA_EN_SHIFT) & PKA_CTRL_PKA_EN_MASK)
#define PKA_CTRL_PKA_EN_GET(x) (((uint32_t)(x) & PKA_CTRL_PKA_EN_MASK) >> PKA_CTRL_PKA_EN_SHIFT)

/* Bitfield definition for register: STA */
/*
 * OSTA (RO)
 *
 * Multiplexed STA. This is the STA from internal firmware.
 */
#define PKA_STA_OSTA_MASK (0xFFFF0000UL)
#define PKA_STA_OSTA_SHIFT (16U)
#define PKA_STA_OSTA_GET(x) (((uint32_t)(x) & PKA_STA_OSTA_MASK) >> PKA_STA_OSTA_SHIFT)

/*
 * INI_DONE (RO)
 *
 * 1: Initialization Done.
 * 0: Initialization not done.
 */
#define PKA_STA_INI_DONE_MASK (0x10U)
#define PKA_STA_INI_DONE_SHIFT (4U)
#define PKA_STA_INI_DONE_GET(x) (((uint32_t)(x) & PKA_STA_INI_DONE_MASK) >> PKA_STA_INI_DONE_SHIFT)

/*
 * OP_DONE (RO)
 *
 * Operation Done
 */
#define PKA_STA_OP_DONE_MASK (0x1U)
#define PKA_STA_OP_DONE_SHIFT (0U)
#define PKA_STA_OP_DONE_GET(x) (((uint32_t)(x) & PKA_STA_OP_DONE_MASK) >> PKA_STA_OP_DONE_SHIFT)

/* Bitfield definition for register: INT_EN_REG */
/*
 * OSTA_IE (RW)
 *
 * interrupt enale for Multiplexed STA bits.
 */
#define PKA_INT_EN_REG_OSTA_IE_MASK (0xFFFF0000UL)
#define PKA_INT_EN_REG_OSTA_IE_SHIFT (16U)
#define PKA_INT_EN_REG_OSTA_IE_SET(x) (((uint32_t)(x) << PKA_INT_EN_REG_OSTA_IE_SHIFT) & PKA_INT_EN_REG_OSTA_IE_MASK)
#define PKA_INT_EN_REG_OSTA_IE_GET(x) (((uint32_t)(x) & PKA_INT_EN_REG_OSTA_IE_MASK) >> PKA_INT_EN_REG_OSTA_IE_SHIFT)

/*
 * OP_DONE_IE (RW)
 *
 * interrupt enale
 */
#define PKA_INT_EN_REG_OP_DONE_IE_MASK (0x1U)
#define PKA_INT_EN_REG_OP_DONE_IE_SHIFT (0U)
#define PKA_INT_EN_REG_OP_DONE_IE_SET(x) (((uint32_t)(x) << PKA_INT_EN_REG_OP_DONE_IE_SHIFT) & PKA_INT_EN_REG_OP_DONE_IE_MASK)
#define PKA_INT_EN_REG_OP_DONE_IE_GET(x) (((uint32_t)(x) & PKA_INT_EN_REG_OP_DONE_IE_MASK) >> PKA_INT_EN_REG_OP_DONE_IE_SHIFT)

/* Bitfield definition for register: OP_CTRL0 */
/*
 * INFO_BLK_IDX (RW)
 *
 * The loc index of related information for storage or retrieve
 * bit 1:0 -- the memory location
 * bit 4:2 -- the info idx
 */
#define PKA_OP_CTRL0_INFO_BLK_IDX_MASK (0xF8000000UL)
#define PKA_OP_CTRL0_INFO_BLK_IDX_SHIFT (27U)
#define PKA_OP_CTRL0_INFO_BLK_IDX_SET(x) (((uint32_t)(x) << PKA_OP_CTRL0_INFO_BLK_IDX_SHIFT) & PKA_OP_CTRL0_INFO_BLK_IDX_MASK)
#define PKA_OP_CTRL0_INFO_BLK_IDX_GET(x) (((uint32_t)(x) & PKA_OP_CTRL0_INFO_BLK_IDX_MASK) >> PKA_OP_CTRL0_INFO_BLK_IDX_SHIFT)

/*
 * INFO_OP (RW)
 *
 * 1: Storage. The following info will be stored into the internal memory. Some Mont transform will be done. So some stored info will be in Mont format.
 * 0: Retrieve. The stored info will be used instead of the following configurations.
 */
#define PKA_OP_CTRL0_INFO_OP_MASK (0x4000000UL)
#define PKA_OP_CTRL0_INFO_OP_SHIFT (26U)
#define PKA_OP_CTRL0_INFO_OP_SET(x) (((uint32_t)(x) << PKA_OP_CTRL0_INFO_OP_SHIFT) & PKA_OP_CTRL0_INFO_OP_MASK)
#define PKA_OP_CTRL0_INFO_OP_GET(x) (((uint32_t)(x) & PKA_OP_CTRL0_INFO_OP_MASK) >> PKA_OP_CTRL0_INFO_OP_SHIFT)

/* Bitfield definition for register: RSA_OP_CTRL */
/*
 * INFO_BLK_IDX (RW)
 *
 * The loc index of related information for storage or retrieve
 * bit 1:0 -- the memory location
 * bit 4:2 -- the info idx
 */
#define PKA_RSA_OP_CTRL_INFO_BLK_IDX_MASK (0xF8000000UL)
#define PKA_RSA_OP_CTRL_INFO_BLK_IDX_SHIFT (27U)
#define PKA_RSA_OP_CTRL_INFO_BLK_IDX_SET(x) (((uint32_t)(x) << PKA_RSA_OP_CTRL_INFO_BLK_IDX_SHIFT) & PKA_RSA_OP_CTRL_INFO_BLK_IDX_MASK)
#define PKA_RSA_OP_CTRL_INFO_BLK_IDX_GET(x) (((uint32_t)(x) & PKA_RSA_OP_CTRL_INFO_BLK_IDX_MASK) >> PKA_RSA_OP_CTRL_INFO_BLK_IDX_SHIFT)

