RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pka_regs.h
/*
 * INFO_OP (RW)
 *
 * 1: Storage. The following info will be stored into the internal memory. Some Mont transform will be done. So some stored info will be in Mont format.
 * 0: Retrieve. The stored info will be used instead of the following configurations.
 */
#define PKA_RSA_OP_CTRL_INFO_OP_MASK (0x4000000UL)
#define PKA_RSA_OP_CTRL_INFO_OP_SHIFT (26U)
#define PKA_RSA_OP_CTRL_INFO_OP_SET(x) (((uint32_t)(x) << PKA_RSA_OP_CTRL_INFO_OP_SHIFT) & PKA_RSA_OP_CTRL_INFO_OP_MASK)
#define PKA_RSA_OP_CTRL_INFO_OP_GET(x) (((uint32_t)(x) & PKA_RSA_OP_CTRL_INFO_OP_MASK) >> PKA_RSA_OP_CTRL_INFO_OP_SHIFT)

/*
 * EQUALIZED_CTRL (RW)
 *
 * the prcessing will be in equalized state. Can only be used for PKA[RSA_BIG_PRIME_PROD] with a size smaller than or equal to 2048.
 */
#define PKA_RSA_OP_CTRL_EQUALIZED_CTRL_MASK (0x2U)
#define PKA_RSA_OP_CTRL_EQUALIZED_CTRL_SHIFT (1U)
#define PKA_RSA_OP_CTRL_EQUALIZED_CTRL_SET(x) (((uint32_t)(x) << PKA_RSA_OP_CTRL_EQUALIZED_CTRL_SHIFT) & PKA_RSA_OP_CTRL_EQUALIZED_CTRL_MASK)
#define PKA_RSA_OP_CTRL_EQUALIZED_CTRL_GET(x) (((uint32_t)(x) & PKA_RSA_OP_CTRL_EQUALIZED_CTRL_MASK) >> PKA_RSA_OP_CTRL_EQUALIZED_CTRL_SHIFT)

/*
 * ECC1_RSA0 (RW)
 *
 * Should be 0 to select RSA
 */
#define PKA_RSA_OP_CTRL_ECC1_RSA0_MASK (0x1U)
#define PKA_RSA_OP_CTRL_ECC1_RSA0_SHIFT (0U)
#define PKA_RSA_OP_CTRL_ECC1_RSA0_SET(x) (((uint32_t)(x) << PKA_RSA_OP_CTRL_ECC1_RSA0_SHIFT) & PKA_RSA_OP_CTRL_ECC1_RSA0_MASK)
#define PKA_RSA_OP_CTRL_ECC1_RSA0_GET(x) (((uint32_t)(x) & PKA_RSA_OP_CTRL_ECC1_RSA0_MASK) >> PKA_RSA_OP_CTRL_ECC1_RSA0_SHIFT)

/* Bitfield definition for register: ECC_OP_CTRL */
/*
 * INFO_BLK_IDX (RW)
 *
 * The loc index of related information for storage or retrieve
 * bit 1:0 -- the memory location
 * bit 4:2 -- the info idx
 */
#define PKA_ECC_OP_CTRL_INFO_BLK_IDX_MASK (0xF8000000UL)
#define PKA_ECC_OP_CTRL_INFO_BLK_IDX_SHIFT (27U)
#define PKA_ECC_OP_CTRL_INFO_BLK_IDX_SET(x) (((uint32_t)(x) << PKA_ECC_OP_CTRL_INFO_BLK_IDX_SHIFT) & PKA_ECC_OP_CTRL_INFO_BLK_IDX_MASK)
#define PKA_ECC_OP_CTRL_INFO_BLK_IDX_GET(x) (((uint32_t)(x) & PKA_ECC_OP_CTRL_INFO_BLK_IDX_MASK) >> PKA_ECC_OP_CTRL_INFO_BLK_IDX_SHIFT)

/*
 * INFO_OP (RW)
 *
 * 1: Storage. The following info will be stored into the internal memory. Some Mont transform will be done. So some stored info will be in Mont format.
 * 0: Retrieve. The stored info will be used instead of the following configurations.
 */
#define PKA_ECC_OP_CTRL_INFO_OP_MASK (0x4000000UL)
#define PKA_ECC_OP_CTRL_INFO_OP_SHIFT (26U)
#define PKA_ECC_OP_CTRL_INFO_OP_SET(x) (((uint32_t)(x) << PKA_ECC_OP_CTRL_INFO_OP_SHIFT) & PKA_ECC_OP_CTRL_INFO_OP_MASK)
#define PKA_ECC_OP_CTRL_INFO_OP_GET(x) (((uint32_t)(x) & PKA_ECC_OP_CTRL_INFO_OP_MASK) >> PKA_ECC_OP_CTRL_INFO_OP_SHIFT)

/*
 * GF_OPT (RW)
 *
 * 1: GF2m
 * 0: GFp
 */
#define PKA_ECC_OP_CTRL_GF_OPT_MASK (0x4U)
#define PKA_ECC_OP_CTRL_GF_OPT_SHIFT (2U)
#define PKA_ECC_OP_CTRL_GF_OPT_SET(x) (((uint32_t)(x) << PKA_ECC_OP_CTRL_GF_OPT_SHIFT) & PKA_ECC_OP_CTRL_GF_OPT_MASK)
#define PKA_ECC_OP_CTRL_GF_OPT_GET(x) (((uint32_t)(x) & PKA_ECC_OP_CTRL_GF_OPT_MASK) >> PKA_ECC_OP_CTRL_GF_OPT_SHIFT)

/*
 * EQUALIZED_CTRL (RW)
 *
 * the prcessing will be in equalized state
 */
#define PKA_ECC_OP_CTRL_EQUALIZED_CTRL_MASK (0x2U)
#define PKA_ECC_OP_CTRL_EQUALIZED_CTRL_SHIFT (1U)
#define PKA_ECC_OP_CTRL_EQUALIZED_CTRL_SET(x) (((uint32_t)(x) << PKA_ECC_OP_CTRL_EQUALIZED_CTRL_SHIFT) & PKA_ECC_OP_CTRL_EQUALIZED_CTRL_MASK)
#define PKA_ECC_OP_CTRL_EQUALIZED_CTRL_GET(x) (((uint32_t)(x) & PKA_ECC_OP_CTRL_EQUALIZED_CTRL_MASK) >> PKA_ECC_OP_CTRL_EQUALIZED_CTRL_SHIFT)

/*
 * ECC1_RSA0 (RW)
 *
 * Should be 1 to select ECC
 */
#define PKA_ECC_OP_CTRL_ECC1_RSA0_MASK (0x1U)
#define PKA_ECC_OP_CTRL_ECC1_RSA0_SHIFT (0U)
#define PKA_ECC_OP_CTRL_ECC1_RSA0_SET(x) (((uint32_t)(x) << PKA_ECC_OP_CTRL_ECC1_RSA0_SHIFT) & PKA_ECC_OP_CTRL_ECC1_RSA0_MASK)
#define PKA_ECC_OP_CTRL_ECC1_RSA0_GET(x) (((uint32_t)(x) & PKA_ECC_OP_CTRL_ECC1_RSA0_MASK) >> PKA_ECC_OP_CTRL_ECC1_RSA0_SHIFT)

/* Bitfield definition for register: OP_CTRL1 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL1_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL1_VAL_SHIFT (0U)
#define PKA_OP_CTRL1_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL1_VAL_SHIFT) & PKA_OP_CTRL1_VAL_MASK)
#define PKA_OP_CTRL1_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL1_VAL_MASK) >> PKA_OP_CTRL1_VAL_SHIFT)

/* Bitfield definition for register: RSA_KEY_SIZE */
/*
 * VAL (RW)
 *
 * The bit length-1 of RSA key (max 4096-1)
 */
#define PKA_RSA_KEY_SIZE_VAL_MASK (0x1FFFU)
#define PKA_RSA_KEY_SIZE_VAL_SHIFT (0U)
#define PKA_RSA_KEY_SIZE_VAL_SET(x) (((uint32_t)(x) << PKA_RSA_KEY_SIZE_VAL_SHIFT) & PKA_RSA_KEY_SIZE_VAL_MASK)
#define PKA_RSA_KEY_SIZE_VAL_GET(x) (((uint32_t)(x) & PKA_RSA_KEY_SIZE_VAL_MASK) >> PKA_RSA_KEY_SIZE_VAL_SHIFT)

/* Bitfield definition for register: ECC_NP0_ORDER_N */
/*
 * VAL (RW)
 *
 * The NP0 parameter for Montegomery transform of ECC order N
 */
#define PKA_ECC_NP0_ORDER_N_VAL_MASK (0xFFFFFFFFUL)
#define PKA_ECC_NP0_ORDER_N_VAL_SHIFT (0U)
#define PKA_ECC_NP0_ORDER_N_VAL_SET(x) (((uint32_t)(x) << PKA_ECC_NP0_ORDER_N_VAL_SHIFT) & PKA_ECC_NP0_ORDER_N_VAL_MASK)
#define PKA_ECC_NP0_ORDER_N_VAL_GET(x) (((uint32_t)(x) & PKA_ECC_NP0_ORDER_N_VAL_MASK) >> PKA_ECC_NP0_ORDER_N_VAL_SHIFT)

/* Bitfield definition for register: OP_CTRL2 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL2_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL2_VAL_SHIFT (0U)
#define PKA_OP_CTRL2_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL2_VAL_SHIFT) & PKA_OP_CTRL2_VAL_MASK)
#define PKA_OP_CTRL2_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL2_VAL_MASK) >> PKA_OP_CTRL2_VAL_SHIFT)

/* Bitfield definition for register: RSA_MONT_N_SIZE */
/*
 * VAL (RW)
 *
 * The bit length of RSA N parameter
 */
#define PKA_RSA_MONT_N_SIZE_VAL_MASK (0x1FFFU)
#define PKA_RSA_MONT_N_SIZE_VAL_SHIFT (0U)
#define PKA_RSA_MONT_N_SIZE_VAL_SET(x) (((uint32_t)(x) << PKA_RSA_MONT_N_SIZE_VAL_SHIFT) & PKA_RSA_MONT_N_SIZE_VAL_MASK)
#define PKA_RSA_MONT_N_SIZE_VAL_GET(x) (((uint32_t)(x) & PKA_RSA_MONT_N_SIZE_VAL_MASK) >> PKA_RSA_MONT_N_SIZE_VAL_SHIFT)

/* Bitfield definition for register: ECC_P_SIZE */
/*
 * H_VAL (RW)
 *
 * Cofactor value
 */
#define PKA_ECC_P_SIZE_H_VAL_MASK (0xFFFF0000UL)
#define PKA_ECC_P_SIZE_H_VAL_SHIFT (16U)
#define PKA_ECC_P_SIZE_H_VAL_SET(x) (((uint32_t)(x) << PKA_ECC_P_SIZE_H_VAL_SHIFT) & PKA_ECC_P_SIZE_H_VAL_MASK)
#define PKA_ECC_P_SIZE_H_VAL_GET(x) (((uint32_t)(x) & PKA_ECC_P_SIZE_H_VAL_MASK) >> PKA_ECC_P_SIZE_H_VAL_SHIFT)

