RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pka_regs.h
/*
 * VAL (RW)
 *
 * The bit length of ECC P parameter
 */
#define PKA_ECC_P_SIZE_VAL_MASK (0x1FFFU)
#define PKA_ECC_P_SIZE_VAL_SHIFT (0U)
#define PKA_ECC_P_SIZE_VAL_SET(x) (((uint32_t)(x) << PKA_ECC_P_SIZE_VAL_SHIFT) & PKA_ECC_P_SIZE_VAL_MASK)
#define PKA_ECC_P_SIZE_VAL_GET(x) (((uint32_t)(x) & PKA_ECC_P_SIZE_VAL_MASK) >> PKA_ECC_P_SIZE_VAL_SHIFT)

/* Bitfield definition for register: OP_CTRL3 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL3_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL3_VAL_SHIFT (0U)
#define PKA_OP_CTRL3_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL3_VAL_SHIFT) & PKA_OP_CTRL3_VAL_MASK)
#define PKA_OP_CTRL3_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL3_VAL_MASK) >> PKA_OP_CTRL3_VAL_SHIFT)

/* Bitfield definition for register: RSA_MONT_R_SIZE */
/*
 * VAL (RE)
 *
 * The bit length of RSA R parameter for Montegomery transform. Should be equal to 32*n+1
 */
#define PKA_RSA_MONT_R_SIZE_VAL_MASK (0x1FFFU)
#define PKA_RSA_MONT_R_SIZE_VAL_SHIFT (0U)
#define PKA_RSA_MONT_R_SIZE_VAL_GET(x) (((uint32_t)(x) & PKA_RSA_MONT_R_SIZE_VAL_MASK) >> PKA_RSA_MONT_R_SIZE_VAL_SHIFT)

/* Bitfield definition for register: ECC_MONT_R_SIZE */
/*
 * KEY_SIZE (RW)
 *
 * The bit length-1 of ECC key
 */
#define PKA_ECC_MONT_R_SIZE_KEY_SIZE_MASK (0xFFFF0000UL)
#define PKA_ECC_MONT_R_SIZE_KEY_SIZE_SHIFT (16U)
#define PKA_ECC_MONT_R_SIZE_KEY_SIZE_SET(x) (((uint32_t)(x) << PKA_ECC_MONT_R_SIZE_KEY_SIZE_SHIFT) & PKA_ECC_MONT_R_SIZE_KEY_SIZE_MASK)
#define PKA_ECC_MONT_R_SIZE_KEY_SIZE_GET(x) (((uint32_t)(x) & PKA_ECC_MONT_R_SIZE_KEY_SIZE_MASK) >> PKA_ECC_MONT_R_SIZE_KEY_SIZE_SHIFT)

/*
 * VAL (RW)
 *
 * The bit length of ECC R parameter for Montegomery transform. Should be equal to 32*n+1
 */
#define PKA_ECC_MONT_R_SIZE_VAL_MASK (0x1FFFU)
#define PKA_ECC_MONT_R_SIZE_VAL_SHIFT (0U)
#define PKA_ECC_MONT_R_SIZE_VAL_SET(x) (((uint32_t)(x) << PKA_ECC_MONT_R_SIZE_VAL_SHIFT) & PKA_ECC_MONT_R_SIZE_VAL_MASK)
#define PKA_ECC_MONT_R_SIZE_VAL_GET(x) (((uint32_t)(x) & PKA_ECC_MONT_R_SIZE_VAL_MASK) >> PKA_ECC_MONT_R_SIZE_VAL_SHIFT)

/* Bitfield definition for register: OP_CTRL4 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL4_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL4_VAL_SHIFT (0U)
#define PKA_OP_CTRL4_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL4_VAL_SHIFT) & PKA_OP_CTRL4_VAL_MASK)
#define PKA_OP_CTRL4_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL4_VAL_MASK) >> PKA_OP_CTRL4_VAL_SHIFT)

/* Bitfield definition for register: RSA_MONT_NP0 */
/*
 * VAL (RE)
 *
 * The NP0 parameter for Montegomery transform of RSA
 */
#define PKA_RSA_MONT_NP0_VAL_MASK (0xFFFFFFFFUL)
#define PKA_RSA_MONT_NP0_VAL_SHIFT (0U)
#define PKA_RSA_MONT_NP0_VAL_GET(x) (((uint32_t)(x) & PKA_RSA_MONT_NP0_VAL_MASK) >> PKA_RSA_MONT_NP0_VAL_SHIFT)

/* Bitfield definition for register: ECC_MONT_NP0 */
/*
 * VAL (RW)
 *
 * The NP0 parameter for ECC P-based Montegomery transform of ECC
 */
#define PKA_ECC_MONT_NP0_VAL_MASK (0xFFFFFFFFUL)
#define PKA_ECC_MONT_NP0_VAL_SHIFT (0U)
#define PKA_ECC_MONT_NP0_VAL_SET(x) (((uint32_t)(x) << PKA_ECC_MONT_NP0_VAL_SHIFT) & PKA_ECC_MONT_NP0_VAL_MASK)
#define PKA_ECC_MONT_NP0_VAL_GET(x) (((uint32_t)(x) & PKA_ECC_MONT_NP0_VAL_MASK) >> PKA_ECC_MONT_NP0_VAL_SHIFT)

/* Bitfield definition for register: OP_CTRL5 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL5_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL5_VAL_SHIFT (0U)
#define PKA_OP_CTRL5_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL5_VAL_SHIFT) & PKA_OP_CTRL5_VAL_MASK)
#define PKA_OP_CTRL5_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL5_VAL_MASK) >> PKA_OP_CTRL5_VAL_SHIFT)

/* Bitfield definition for register: RSA_MONT_R2_MOD_N_PTR */
/*
 * VAL (RW)
 *
 * The address pointer value for holding the value of mod(R*R, N) for Montegomery transform
 */
#define PKA_RSA_MONT_R2_MOD_N_PTR_VAL_MASK (0x1FFFU)
#define PKA_RSA_MONT_R2_MOD_N_PTR_VAL_SHIFT (0U)
#define PKA_RSA_MONT_R2_MOD_N_PTR_VAL_SET(x) (((uint32_t)(x) << PKA_RSA_MONT_R2_MOD_N_PTR_VAL_SHIFT) & PKA_RSA_MONT_R2_MOD_N_PTR_VAL_MASK)
#define PKA_RSA_MONT_R2_MOD_N_PTR_VAL_GET(x) (((uint32_t)(x) & PKA_RSA_MONT_R2_MOD_N_PTR_VAL_MASK) >> PKA_RSA_MONT_R2_MOD_N_PTR_VAL_SHIFT)

/* Bitfield definition for register: ECC_MONT_R2_MOD_P_PTR */
/*
 * VAL (RW)
 *
 * The address pointer value for holding the value of mod(R*R, P) for Montegomery transform
 */
#define PKA_ECC_MONT_R2_MOD_P_PTR_VAL_MASK (0x1FFFU)
#define PKA_ECC_MONT_R2_MOD_P_PTR_VAL_SHIFT (0U)
#define PKA_ECC_MONT_R2_MOD_P_PTR_VAL_SET(x) (((uint32_t)(x) << PKA_ECC_MONT_R2_MOD_P_PTR_VAL_SHIFT) & PKA_ECC_MONT_R2_MOD_P_PTR_VAL_MASK)
#define PKA_ECC_MONT_R2_MOD_P_PTR_VAL_GET(x) (((uint32_t)(x) & PKA_ECC_MONT_R2_MOD_P_PTR_VAL_MASK) >> PKA_ECC_MONT_R2_MOD_P_PTR_VAL_SHIFT)

/* Bitfield definition for register: OP_CTRL6 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL6_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL6_VAL_SHIFT (0U)
#define PKA_OP_CTRL6_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL6_VAL_SHIFT) & PKA_OP_CTRL6_VAL_MASK)
#define PKA_OP_CTRL6_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL6_VAL_MASK) >> PKA_OP_CTRL6_VAL_SHIFT)

/* Bitfield definition for register: RSA_BIG_PRIME_PROD */
/*
 * ADDR (RW)
 *
 * The starting location of RSA big prime production inside the local 256-bits blocks
 */
#define PKA_RSA_BIG_PRIME_PROD_ADDR_MASK (0x1FFFU)
#define PKA_RSA_BIG_PRIME_PROD_ADDR_SHIFT (0U)
#define PKA_RSA_BIG_PRIME_PROD_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_BIG_PRIME_PROD_ADDR_SHIFT) & PKA_RSA_BIG_PRIME_PROD_ADDR_MASK)
#define PKA_RSA_BIG_PRIME_PROD_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_BIG_PRIME_PROD_ADDR_MASK) >> PKA_RSA_BIG_PRIME_PROD_ADDR_SHIFT)

/* Bitfield definition for register: ECC_A */
/*
 * ADDR (RW)
 *
 * The address of the ECC Curve parameter A inside the local 256-bits blocks
 */
#define PKA_ECC_A_ADDR_MASK (0x1FFFU)
#define PKA_ECC_A_ADDR_SHIFT (0U)
#define PKA_ECC_A_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_A_ADDR_SHIFT) & PKA_ECC_A_ADDR_MASK)
#define PKA_ECC_A_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_A_ADDR_MASK) >> PKA_ECC_A_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRL7 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL7_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL7_VAL_SHIFT (0U)
#define PKA_OP_CTRL7_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL7_VAL_SHIFT) & PKA_OP_CTRL7_VAL_MASK)
#define PKA_OP_CTRL7_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL7_VAL_MASK) >> PKA_OP_CTRL7_VAL_SHIFT)

/* Bitfield definition for register: RSA_PUB_KEY */
/*
 * ADDR (RW)
 *
 * The starting location of RSA public key inside the local 256-bits blocks
 */
#define PKA_RSA_PUB_KEY_ADDR_MASK (0x1FFFU)
#define PKA_RSA_PUB_KEY_ADDR_SHIFT (0U)
#define PKA_RSA_PUB_KEY_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_PUB_KEY_ADDR_SHIFT) & PKA_RSA_PUB_KEY_ADDR_MASK)
#define PKA_RSA_PUB_KEY_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_PUB_KEY_ADDR_MASK) >> PKA_RSA_PUB_KEY_ADDR_SHIFT)

/* Bitfield definition for register: ECC_B */
/*
 * ADDR (RW)
 *
 * The address of the ECC Curve parameter B inside the local 256-bits blocks
 */
#define PKA_ECC_B_ADDR_MASK (0x1FFFU)
#define PKA_ECC_B_ADDR_SHIFT (0U)
#define PKA_ECC_B_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_B_ADDR_SHIFT) & PKA_ECC_B_ADDR_MASK)
#define PKA_ECC_B_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_B_ADDR_MASK) >> PKA_ECC_B_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRL8 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL8_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL8_VAL_SHIFT (0U)
#define PKA_OP_CTRL8_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL8_VAL_SHIFT) & PKA_OP_CTRL8_VAL_MASK)
#define PKA_OP_CTRL8_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL8_VAL_MASK) >> PKA_OP_CTRL8_VAL_SHIFT)

/* Bitfield definition for register: ECC_P */
/*
 * ADDR (RW)
 *
 * The address of the ECC parameter P inside the local 256-bits blocks
 */
#define PKA_ECC_P_ADDR_MASK (0x1FFFU)
#define PKA_ECC_P_ADDR_SHIFT (0U)
#define PKA_ECC_P_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_P_ADDR_SHIFT) & PKA_ECC_P_ADDR_MASK)
#define PKA_ECC_P_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_P_ADDR_MASK) >> PKA_ECC_P_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRL9 */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRL9_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRL9_VAL_SHIFT (0U)
#define PKA_OP_CTRL9_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRL9_VAL_SHIFT) & PKA_OP_CTRL9_VAL_MASK)
#define PKA_OP_CTRL9_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRL9_VAL_MASK) >> PKA_OP_CTRL9_VAL_SHIFT)

