RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pka_regs.h
/* Bitfield definition for register: RSA_M */
/*
 * ADDR (RW)
 *
 * The starting location of RSA buffer M inside the local 256-bits blocks
 */
#define PKA_RSA_M_ADDR_MASK (0x1FFFU)
#define PKA_RSA_M_ADDR_SHIFT (0U)
#define PKA_RSA_M_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_M_ADDR_SHIFT) & PKA_RSA_M_ADDR_MASK)
#define PKA_RSA_M_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_M_ADDR_MASK) >> PKA_RSA_M_ADDR_SHIFT)

/* Bitfield definition for register: ECC_GEN_X */
/*
 * ADDR (RW)
 *
 * The address of the ECC generator X location inside the local 256-bits blocks
 */
#define PKA_ECC_GEN_X_ADDR_MASK (0x1FFFU)
#define PKA_ECC_GEN_X_ADDR_SHIFT (0U)
#define PKA_ECC_GEN_X_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_GEN_X_ADDR_SHIFT) & PKA_ECC_GEN_X_ADDR_MASK)
#define PKA_ECC_GEN_X_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_GEN_X_ADDR_MASK) >> PKA_ECC_GEN_X_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRLA */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRLA_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRLA_VAL_SHIFT (0U)
#define PKA_OP_CTRLA_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRLA_VAL_SHIFT) & PKA_OP_CTRLA_VAL_MASK)
#define PKA_OP_CTRLA_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRLA_VAL_MASK) >> PKA_OP_CTRLA_VAL_SHIFT)

/* Bitfield definition for register: RSA_TM0 */
/*
 * ADDR (RW)
 *
 * The starting location of RSA buffer TM0 inside the local 256-bits blocks
 */
#define PKA_RSA_TM0_ADDR_MASK (0x1FFFU)
#define PKA_RSA_TM0_ADDR_SHIFT (0U)
#define PKA_RSA_TM0_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_TM0_ADDR_SHIFT) & PKA_RSA_TM0_ADDR_MASK)
#define PKA_RSA_TM0_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_TM0_ADDR_MASK) >> PKA_RSA_TM0_ADDR_SHIFT)

/* Bitfield definition for register: ECC_GEN_Y */
/*
 * ADDR (RW)
 *
 * The address of the ECC generator Y location inside the local 256-bits blocks
 */
#define PKA_ECC_GEN_Y_ADDR_MASK (0x1FFFU)
#define PKA_ECC_GEN_Y_ADDR_SHIFT (0U)
#define PKA_ECC_GEN_Y_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_GEN_Y_ADDR_SHIFT) & PKA_ECC_GEN_Y_ADDR_MASK)
#define PKA_ECC_GEN_Y_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_GEN_Y_ADDR_MASK) >> PKA_ECC_GEN_Y_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRLB */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRLB_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRLB_VAL_SHIFT (0U)
#define PKA_OP_CTRLB_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRLB_VAL_SHIFT) & PKA_OP_CTRLB_VAL_MASK)
#define PKA_OP_CTRLB_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRLB_VAL_MASK) >> PKA_OP_CTRLB_VAL_SHIFT)

/* Bitfield definition for register: RSA_TM1 */
/*
 * ADDR (RW)
 *
 * The starting location of RSA buffer TM1 inside the local 256-bits blocks
 */
#define PKA_RSA_TM1_ADDR_MASK (0x1FFFU)
#define PKA_RSA_TM1_ADDR_SHIFT (0U)
#define PKA_RSA_TM1_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_TM1_ADDR_SHIFT) & PKA_RSA_TM1_ADDR_MASK)
#define PKA_RSA_TM1_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_TM1_ADDR_MASK) >> PKA_RSA_TM1_ADDR_SHIFT)

/* Bitfield definition for register: ECC_PUB_X */
/*
 * ADDR (RW)
 *
 * The address of the ECC public key X location inside the local 256-bits blocks
 */
#define PKA_ECC_PUB_X_ADDR_MASK (0x1FFFU)
#define PKA_ECC_PUB_X_ADDR_SHIFT (0U)
#define PKA_ECC_PUB_X_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_PUB_X_ADDR_SHIFT) & PKA_ECC_PUB_X_ADDR_MASK)
#define PKA_ECC_PUB_X_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_PUB_X_ADDR_MASK) >> PKA_ECC_PUB_X_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRLC */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRLC_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRLC_VAL_SHIFT (0U)
#define PKA_OP_CTRLC_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRLC_VAL_SHIFT) & PKA_OP_CTRLC_VAL_MASK)
#define PKA_OP_CTRLC_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRLC_VAL_MASK) >> PKA_OP_CTRLC_VAL_SHIFT)

/* Bitfield definition for register: RSA_O */
/*
 * ADDR (RW)
 *
 * The starting location of RSA buffer O inside the local 256-bits blocks
 */
#define PKA_RSA_O_ADDR_MASK (0x1FFFU)
#define PKA_RSA_O_ADDR_SHIFT (0U)
#define PKA_RSA_O_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_O_ADDR_SHIFT) & PKA_RSA_O_ADDR_MASK)
#define PKA_RSA_O_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_O_ADDR_MASK) >> PKA_RSA_O_ADDR_SHIFT)

/* Bitfield definition for register: ECC_PUB_Y */
/*
 * ADDR (RW)
 *
 * The address of the ECC public key Y location inside the local 256-bits blocks
 */
#define PKA_ECC_PUB_Y_ADDR_MASK (0x1FFFU)
#define PKA_ECC_PUB_Y_ADDR_SHIFT (0U)
#define PKA_ECC_PUB_Y_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_PUB_Y_ADDR_SHIFT) & PKA_ECC_PUB_Y_ADDR_MASK)
#define PKA_ECC_PUB_Y_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_PUB_Y_ADDR_MASK) >> PKA_ECC_PUB_Y_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRLD */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRLD_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRLD_VAL_SHIFT (0U)
#define PKA_OP_CTRLD_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRLD_VAL_SHIFT) & PKA_OP_CTRLD_VAL_MASK)
#define PKA_OP_CTRLD_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRLD_VAL_MASK) >> PKA_OP_CTRLD_VAL_SHIFT)

/* Bitfield definition for register: RSA_PRIV_KEY */
/*
 * SRC_CHOICE (RW)
 *
 * Key Choice
 * 0: key inside memory. The below ADDR is the src storage loc.
 * 1: key from efuse
 * 2: key from rng,
 */
#define PKA_RSA_PRIV_KEY_SRC_CHOICE_MASK (0x60000000UL)
#define PKA_RSA_PRIV_KEY_SRC_CHOICE_SHIFT (29U)
#define PKA_RSA_PRIV_KEY_SRC_CHOICE_SET(x) (((uint32_t)(x) << PKA_RSA_PRIV_KEY_SRC_CHOICE_SHIFT) & PKA_RSA_PRIV_KEY_SRC_CHOICE_MASK)
#define PKA_RSA_PRIV_KEY_SRC_CHOICE_GET(x) (((uint32_t)(x) & PKA_RSA_PRIV_KEY_SRC_CHOICE_MASK) >> PKA_RSA_PRIV_KEY_SRC_CHOICE_SHIFT)

/*
 * STR_CHOICE (RW)
 *
 * Key Store Choice: only active when key is not inside memory
 * 0: don't copy key from key management
 * 1: copy key to internal memory indicated by the ADDR field in this config register. Then clear this bit and SRC_CHOICE bits stored in internal memory.
 */
#define PKA_RSA_PRIV_KEY_STR_CHOICE_MASK (0x10000000UL)
#define PKA_RSA_PRIV_KEY_STR_CHOICE_SHIFT (28U)
#define PKA_RSA_PRIV_KEY_STR_CHOICE_SET(x) (((uint32_t)(x) << PKA_RSA_PRIV_KEY_STR_CHOICE_SHIFT) & PKA_RSA_PRIV_KEY_STR_CHOICE_MASK)
#define PKA_RSA_PRIV_KEY_STR_CHOICE_GET(x) (((uint32_t)(x) & PKA_RSA_PRIV_KEY_STR_CHOICE_MASK) >> PKA_RSA_PRIV_KEY_STR_CHOICE_SHIFT)

