RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6E00/ip/hpm_pka_regs.h
/*
 * ADDR (RW)
 *
 * The starting location of RSA private key inside the local 256-bits blocks
 */
#define PKA_RSA_PRIV_KEY_ADDR_MASK (0x1FFFU)
#define PKA_RSA_PRIV_KEY_ADDR_SHIFT (0U)
#define PKA_RSA_PRIV_KEY_ADDR_SET(x) (((uint32_t)(x) << PKA_RSA_PRIV_KEY_ADDR_SHIFT) & PKA_RSA_PRIV_KEY_ADDR_MASK)
#define PKA_RSA_PRIV_KEY_ADDR_GET(x) (((uint32_t)(x) & PKA_RSA_PRIV_KEY_ADDR_MASK) >> PKA_RSA_PRIV_KEY_ADDR_SHIFT)

/* Bitfield definition for register: ECC_PRIV_K */
/*
 * SRC_CHOICE (RW)
 *
 * Key Choice
 * 0: key inside memory. The below ADDR is the src storage loc.
 * 1: key from efuse
 * 2: key from rng,
 */
#define PKA_ECC_PRIV_K_SRC_CHOICE_MASK (0x60000000UL)
#define PKA_ECC_PRIV_K_SRC_CHOICE_SHIFT (29U)
#define PKA_ECC_PRIV_K_SRC_CHOICE_SET(x) (((uint32_t)(x) << PKA_ECC_PRIV_K_SRC_CHOICE_SHIFT) & PKA_ECC_PRIV_K_SRC_CHOICE_MASK)
#define PKA_ECC_PRIV_K_SRC_CHOICE_GET(x) (((uint32_t)(x) & PKA_ECC_PRIV_K_SRC_CHOICE_MASK) >> PKA_ECC_PRIV_K_SRC_CHOICE_SHIFT)

/*
 * ADDR (RW)
 *
 * The address of the ECC private key K location  inside the local 256-bits blocks
 */
#define PKA_ECC_PRIV_K_ADDR_MASK (0x1FFFU)
#define PKA_ECC_PRIV_K_ADDR_SHIFT (0U)
#define PKA_ECC_PRIV_K_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_PRIV_K_ADDR_SHIFT) & PKA_ECC_PRIV_K_ADDR_MASK)
#define PKA_ECC_PRIV_K_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_PRIV_K_ADDR_MASK) >> PKA_ECC_PRIV_K_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRLE */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRLE_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRLE_VAL_SHIFT (0U)
#define PKA_OP_CTRLE_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRLE_VAL_SHIFT) & PKA_OP_CTRLE_VAL_MASK)
#define PKA_OP_CTRLE_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRLE_VAL_MASK) >> PKA_OP_CTRLE_VAL_SHIFT)

/* Bitfield definition for register: ECC_GENORD_N */
/*
 * ADDR (RW)
 *
 * The address of the order N of ECC generator inside the local 256-bits blocks
 */
#define PKA_ECC_GENORD_N_ADDR_MASK (0x1FFFU)
#define PKA_ECC_GENORD_N_ADDR_SHIFT (0U)
#define PKA_ECC_GENORD_N_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_GENORD_N_ADDR_SHIFT) & PKA_ECC_GENORD_N_ADDR_MASK)
#define PKA_ECC_GENORD_N_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_GENORD_N_ADDR_MASK) >> PKA_ECC_GENORD_N_ADDR_SHIFT)

/* Bitfield definition for register: OP_CTRLF */
/*
 * VAL (RW)
 *
 * The config words contents
 */
#define PKA_OP_CTRLF_VAL_MASK (0xFFFFFFFFUL)
#define PKA_OP_CTRLF_VAL_SHIFT (0U)
#define PKA_OP_CTRLF_VAL_SET(x) (((uint32_t)(x) << PKA_OP_CTRLF_VAL_SHIFT) & PKA_OP_CTRLF_VAL_MASK)
#define PKA_OP_CTRLF_VAL_GET(x) (((uint32_t)(x) & PKA_OP_CTRLF_VAL_MASK) >> PKA_OP_CTRLF_VAL_SHIFT)

/* Bitfield definition for register: ECC_R2N_ORDER_N */
/*
 * ADDR (RW)
 *
 * The address of mod(R*R, N) for the order N of ECC generators inside the local 256-bits blocks
 */
#define PKA_ECC_R2N_ORDER_N_ADDR_MASK (0x1FFFU)
#define PKA_ECC_R2N_ORDER_N_ADDR_SHIFT (0U)
#define PKA_ECC_R2N_ORDER_N_ADDR_SET(x) (((uint32_t)(x) << PKA_ECC_R2N_ORDER_N_ADDR_SHIFT) & PKA_ECC_R2N_ORDER_N_ADDR_MASK)
#define PKA_ECC_R2N_ORDER_N_ADDR_GET(x) (((uint32_t)(x) & PKA_ECC_R2N_ORDER_N_ADDR_MASK) >> PKA_ECC_R2N_ORDER_N_ADDR_SHIFT)




#endif /* HPM_PKA_H */
